jnsbyr/esp8266-intexsbh20/PureSpaIO.cpp
bool PureSpaIO::isOnline() const
{
  return state.online;
}

unsigned int PureSpaIO::getTotalFrames() const
{
  return state.frameCounter;
}

unsigned int PureSpaIO::getDroppedFrames() const
{
  return state.frameDropped;
}

/**
 * @return actual water temperatur [°C] 0..60 or UNDEF::INT if unknown
 */
int PureSpaIO::getActWaterTempCelsius() const
{
  return (state.waterTemp != UNDEF::UINT) ? convertDisplayToCelsius(state.waterTemp) : UNDEF::INT;
}

/**
 * @return desired water temperatur [°C] or UNDEF::INT if unknown
 *
 * note: value is undefined after power up until value is changed
 */
int PureSpaIO::getDesiredWaterTempCelsius() const
{
  return (state.desiredTemp != UNDEF::UINT) ? convertDisplayToCelsius(state.desiredTemp) : UNDEF::INT;
}

/**
 * @return disinfection duration [h] 0/3/5/8 h or UNDEF::INT if unknown
 *
 * note: value is undefined after power up until disinfection is activated
 */
int PureSpaIO::getDisinfectionTime() const
{
  return isDisinfectionOn() ? (state.disinfectionTime != UNDEF::UINT ? display2Num(state.disinfectionTime) : UNDEF::INT) : 0;
}

String PureSpaIO::getErrorCode() const
{
  memcpy((void*)errorBuffer, (void*)&state.error, 4);
  return errorBuffer;
}

String PureSpaIO::getErrorMessage(const String& errorCode) const
{
  if (errorCode.length())
  {
    // get error index
    unsigned int errorIndex = UINT_MAX;
    for (unsigned int i=0; i<ERROR::COUNT; i++)
    {
      String ec = FPSTR(ERROR::TEXT[(unsigned int)LANG::CODE][i]);
      if (errorCode == ec)
      {
        errorIndex = i;
        break;
      }
    }

    // get error translation
    if (errorIndex != UINT_MAX)
    {
      return FPSTR(ERROR::TEXT[(unsigned int)language][errorIndex]);
    }
    else
    {
      // undefined error
      return errorCode;
    }
  }
  else
  {
    // no error
    return errorCode;
  }
}

unsigned int PureSpaIO::getRawLedValue() const
{
  return (state.ledStatus != UNDEF::USHORT) ? state.ledStatus : UNDEF::USHORT;
}

uint8 PureSpaIO::isPowerOn() const
{
  return (state.ledStatus != UNDEF::USHORT) ? ((state.ledStatus & FRAME_LED::POWER) != 0) : UNDEF::BOOL;
}

uint8 PureSpaIO::isFilterOn() const
{
  return (state.ledStatus != UNDEF::USHORT) ? ((state.ledStatus & FRAME_LED::FILTER) != 0) : UNDEF::BOOL;
}

uint8 PureSpaIO::isBubbleOn() const
{
  return (state.ledStatus != UNDEF::USHORT) ? ((state.ledStatus & FRAME_LED::BUBBLE) != 0) : UNDEF::BOOL;
}

uint8 PureSpaIO::isHeaterOn() const
{
  return (state.ledStatus != UNDEF::USHORT) ? ((state.ledStatus & (FRAME_LED::HEATER_ON | FRAME_LED::HEATER_STANDBY)) != 0) : UNDEF::BOOL;
}

uint8 PureSpaIO::isHeaterStandby() const
{
  return (state.ledStatus != UNDEF::USHORT) ? ((state.ledStatus & FRAME_LED::HEATER_STANDBY) != 0) : UNDEF::BOOL;
}

uint8 PureSpaIO::isBuzzerOn() const
{
  return (state.ledStatus != UNDEF::USHORT) ? ((state.ledStatus & FRAME_LED::NO_BEEP) == 0) : UNDEF::BOOL;
}

uint8 PureSpaIO::isDisinfectionOn() const
{
#ifdef MODEL_SJB_HS
  return (state.ledStatus != UNDEF::USHORT) ? ((state.ledStatus & FRAME_LED::DISINFECTION) != 0) : UNDEF::BOOL;
#else
  return false;
#endif
}

uint8 PureSpaIO::isJetOn() const
{
#ifdef MODEL_SJB_HS
  return (state.ledStatus != UNDEF::USHORT) ? ((state.ledStatus & FRAME_LED::JET) != 0) : UNDEF::BOOL;
#else
  return false;
#endif
}

/**
 * set desired water temperature by performing button up or down actions
 * repeatedly depending on temperature delta
 *
 * notes:
 * - method will block until setting is completed
 * - WiFi is temporarily put to sleep to improve receive decoding reliability
 * - actual setpoint is not checked for verification because this
 *   would slow down the setpoint modification significantly
 *
 * @param temp water temperature setpoint [°C]
 */
void PureSpaIO::setDesiredWaterTempCelsius(int temp)
{
  if (temp >= WATER_TEMP::SET_MIN && temp <= WATER_TEMP::SET_MAX)
  {
    if (isPowerOn() && state.error == ERROR_NONE)
    {
#ifdef FORCE_WIFI_SLEEP
      // try to get initial temp
      WiFi.forceSleepBegin();
      int setTemp = getDesiredWaterTempCelsius();
      //DEBUG_MSG("\nBset %d", setTemp);
      bool modifying = false;
      if (setTemp == UNDEF::INT)
      {
        // trigger temp modification
        changeWaterTemp(-1);
        modifying = true;

        // wait for temp readback (will take 2-3 blink durations)
        int sleep = 20; // ms
        int tries = 4*BLINK::PERIOD/sleep;
        do
        {
          delay(sleep);
          setTemp = getDesiredWaterTempCelsius();
          tries--;
        } while (setTemp == UNDEF::INT && tries);

        // check success
        if (setTemp == UNDEF::INT)
        {
          // error, abort
          WiFi.forceSleepWake();
          delay(1);
          DEBUG_MSG("\naborted\n");
          return;
        }
      }

      // modify desired temp
      int deltaTemp = temp - setTemp;
      //DEBUG_MSG("\nBdelta %d", deltaTemp);
      while (deltaTemp)
      {
        ESP.wdtFeed();
        if (deltaTemp > 0)
        {
          //DEBUG_MSG("\nBU");
          changeWaterTemp(1);
          if (modifying)
          {
            deltaTemp--;
            setTemp++;
          }
        }
        else
        {
          //DEBUG_MSG("\nBD");
          changeWaterTemp(-1);
          if (modifying)
          {
            deltaTemp++;
            setTemp--;
          }
        }
        modifying = true;
      }

      WiFi.forceSleepWake();
      delay(1);
#else
      // trigger temp modification
      changeWaterTemp(-1);

      int sleep = 100; // ms
      int changeTries = WATER_TEMP::SET_MAX - WATER_TEMP::SET_MIN + 3;
      int setTemp = UNDEF::INT;
      do
      {
        // wait for temp readback (will take 2-3 blink durations)
        int readTries = 5*BLINK::PERIOD/sleep;
        int newSetTemp = UNDEF::INT;
        ESP.wdtFeed();
        delay(BLINK::PERIOD);
        do
        {
          delay(sleep);
          newSetTemp = getDesiredWaterTempCelsius();
          readTries--;
        } while (newSetTemp == setTemp && readTries);
        DEBUG_MSG("\nst:%d (rt:%d)", newSetTemp, readTries);

        // check success
        if (newSetTemp == UNDEF::INT)
        {
          // error, abort
          DEBUG_MSG("\naborted\n");
          return;
        }
        else
        {
          // success, check direction and change
          setTemp = newSetTemp;
          if (temp > setTemp)
          {
            if (!changeWaterTemp(+1))
              changeWaterTemp(+1);
            changeTries--;
          }
          else if (temp < setTemp)
          {
            if (!changeWaterTemp(-1))
              changeWaterTemp(-1);
            changeTries--;
          }
        }
      } while (temp != setTemp && changeTries);
      DEBUG_MSG("\ncT:%d", changeTries);
#endif
    }
  }
}

/**
 * set desired disinfection duration by performing button actions
 * repeatedly until the requested duration is displayed
 *
 * notes:
 * - method will block until setting is completed
 * - WiFi is temporarily put to sleep to improve receive decoding reliability
 *
 * @param hours disinfection duration 0/3/5/8 h
 */
void PureSpaIO::setDisinfectionTime(int hours)
{
  // use nearest available value
  if (hours > 5)      hours = 8;
  else if (hours > 3) hours = 5;
  else if (hours > 0) hours = 3;
  else                hours = 0;

  if (isPowerOn() && state.error == ERROR_NONE)
  {
#ifdef FORCE_WIFI_SLEEP
    WiFi.forceSleepBegin();
#endif

    int tries = 8;
    do
    {
      // get actual disinfection time
      int actHours = getDisinfectionTime();
      if (actHours == UNDEF::INT)
      {
        // error reading actual time, abort
        DEBUG_MSG("\naborted\n");
        break;
      }
      else if (actHours == hours)
      {
        // set and act time matches, done
        break;
      }

      // toggle disinfection time
      pressButton(buttons.toggleDisinfection);
      tries--;
    } while (tries);

