jnsbyr/esp8266-intexsbh20/PureSpaIO.cpp
#ifdef FORCE_WIFI_SLEEP
    WiFi.forceSleepWake();
    delay(1);
#endif
  }
}

/**
 * press specific button and wait for confirmation (blocking)
 *
 * notes:
 * - WiFi is temporarily put to sleep to improve receive decoding reliability
 *
 * @param buttonPressCount
 * @return true if beep was received, false if no beep was received until timeout
 */
bool PureSpaIO::pressButton(volatile unsigned int& buttonPressCount)
{
  WiFi.setSleepMode(WIFI_LIGHT_SLEEP);
  waitBuzzerOff();
  unsigned int tries = BUTTON::ACK_TIMEOUT/BUTTON::ACK_CHECK_PERIOD;
  buttonPressCount = BUTTON::PRESS_COUNT;
  while (buttonPressCount && tries)
  {
    delay(BUTTON::ACK_CHECK_PERIOD);
    tries--;
  }
  WiFi.setSleepMode(WIFI_NONE_SLEEP);

  return tries;
}

void PureSpaIO::setBubbleOn(bool on)
{
  if (on ^ (isBubbleOn() == true))
  {
    pressButton(buttons.toggleBubble);
  }
}

void PureSpaIO::setFilterOn(bool on)
{
  if (on ^ (isFilterOn() == true))
  {
    pressButton(buttons.toggleFilter);
  }
}

void PureSpaIO::setHeaterOn(bool on)
{
  if (on ^ (isHeaterOn() == true || isHeaterStandby() == true))
  {
    pressButton(buttons.toggleHeater);
  }
}

void PureSpaIO::setJetOn(bool on)
{
  if (on ^ (isJetOn() == true))
  {
    pressButton(buttons.toggleJet);
  }
}

void PureSpaIO::setPowerOn(bool on)
{
  bool active = isPowerOn() == true;
  if (on ^ active)
  {
    pressButton(buttons.togglePower);
  }
}

/**
 * wait for buzzer to go off or timeout
 * and delay for a cycle period
 *
 * @return true if buzzer is off, false if buzzer is still on after timeout
 */
bool PureSpaIO::waitBuzzerOff() const
{
  int tries = BUTTON::ACK_TIMEOUT/BUTTON::ACK_CHECK_PERIOD;
  while (state.buzzer && tries)
  {
    delay(BUTTON::ACK_CHECK_PERIOD);
    tries--;
  }

  // extra delay reduces chance to trigger auto repeat
  if (tries)
  {
    delay(2*CYCLE::PERIOD);
    return true;
  }
  else
  {
    DEBUG_MSG("\nwBO fail");
    return false;
  }
}

/**
 * change water temperature setpoint by 1 degree and wait for confirmation (blocking)
 *
 * @param up press up (> 0) or down (< 0) button
 * @return true if beep was received, false if no beep was received until timeout
 */
bool PureSpaIO::changeWaterTemp(int up)
{
  if (isPowerOn() && state.error == ERROR_NONE)
  {
    // perform button action
    waitBuzzerOff();
    //DEBUG_MSG("\nP ");
#ifndef FORCE_WIFI_SLEEP
    WiFi.setSleepMode(WIFI_LIGHT_SLEEP);
#endif
    int tries = BUTTON::ACK_TIMEOUT/BUTTON::ACK_CHECK_PERIOD;
    if (up > 0)
    {
      buttons.toggleTempUp = BUTTON::PRESS_COUNT;
      while (buttons.toggleTempUp && tries)
      {
        delay(BUTTON::ACK_CHECK_PERIOD);
        tries--;
      }
    }
    else if (up < 0)
    {
      buttons.toggleTempDown = BUTTON::PRESS_COUNT;
      while (buttons.toggleTempDown && tries)
      {
        delay(BUTTON::ACK_CHECK_PERIOD);
        tries--;
      }
    }
#ifndef FORCE_WIFI_SLEEP
    WiFi.setSleepMode(WIFI_NONE_SLEEP);
#endif

    if (tries && state.buzzer)
    {
      return true;
    }
    else
    {
      DEBUG_MSG("\ncWT fail");
    }
  }

  return false;
}

int PureSpaIO::convertDisplayToCelsius(uint32 value) const
{
  int celsiusValue = display2Num(value);
  char tempUnit = display2LastDigit(value);
  //DEBUG_MSG("\nDtC 0x%x =  %d%c", value, celsiusValue, tempUnit);
  if (tempUnit == 'F')
  {
    // convert °F to °C
    float fValue = (float)celsiusValue;
    celsiusValue = (int)round(((fValue - 32) * 5) / 9);
  }
  else if (tempUnit != 'C')
  {
    celsiusValue = UNDEF::INT;
  }

  return (celsiusValue >= 0) && (celsiusValue <= 60) ? celsiusValue : UNDEF::INT;
}

ICACHE_RAM_ATTR void PureSpaIO::clockRisingISR(void* arg)
{
  bool data = !digitalRead(PIN::DATA);
  bool enabled = !digitalRead(PIN::LATCH);

  if (enabled || isrState.receivedBits == (FRAME::BITS - 1))
  {
    isrState.frameValue = (isrState.frameValue << 1) + data;
    isrState.receivedBits++;

    if (isrState.receivedBits == FRAME::BITS)
    {
      state.frameCounter++;
      if (isrState.frameValue == FRAME_TYPE::CUE)
      {
        // cue frame, ignore
        //DEBUG_MSG("\nC");
      }
      else if (isrState.frameValue & FRAME_TYPE::DIGIT)
      {
        // display frame
        //DEBUG_MSG("\nD");
        decodeDisplay();
      }
      else if (isrState.frameValue & FRAME_TYPE::LED)
      {
        // LED frame
        //DEBUG_MSG("\nL");
        decodeLED();
      }
      else if (isrState.frameValue & FRAME_TYPE::BUTTON)
      {
        // button frame
        //DEBUG_MSG("\nB");
        decodeButton();
      }
      else if (isrState.frameValue != 0)
      {
        // unsupported frame
        //DEBUG_MSG("\nU");
      }

      isrState.receivedBits = 0;
    }
  }
  else
  {
    //DEBUG_MSG(" %d ", receivedBits);
    isrState.receivedBits = 0;
    state.frameCounter++;
  }
}

ICACHE_RAM_ATTR inline void PureSpaIO::decodeDisplay()
{
  char digit;
  switch (isrState.frameValue & FRAME_DIGIT::SEGMENTS)
  {
    case FRAME_DIGIT::OFF:
      digit = DIGIT::OFF;
      break;
    case FRAME_DIGIT::NUM_0:
      digit = '0';
      break;
    case FRAME_DIGIT::NUM_1:
      digit = '1';
      break;
    case FRAME_DIGIT::NUM_2:
      digit = '2';
      break;
    case FRAME_DIGIT::NUM_3:
      digit = '3';
      break;
    case FRAME_DIGIT::NUM_4:
      digit = '4';
      break;
    case FRAME_DIGIT::NUM_5:
      digit = '5';
      break;
    case FRAME_DIGIT::NUM_6:
      digit = '6';
      break;
    case FRAME_DIGIT::NUM_7:
      digit = '7';
      break;
    case FRAME_DIGIT::NUM_8:
      digit = '8';
      break;
    case FRAME_DIGIT::NUM_9:
      digit = '9';
      break;
    case FRAME_DIGIT::LET_C:
      digit = 'C'; // temp unit °C
      break;
    case FRAME_DIGIT::LET_D:
      digit = 'D';
      break;
    case FRAME_DIGIT::LET_E:
      digit = 'E';
      break;
    case FRAME_DIGIT::LET_F:
      digit = 'F'; // temp unit °F
      break;
    case FRAME_DIGIT::LET_H:
      digit = 'H';
      break;
    case FRAME_DIGIT::LET_N:
      digit = 'N';
      break;

    default:
      // unsupported, ignore
      return;
  }

  switch (isrState.frameValue & FRAME_TYPE::DIGIT)
  {
    case FRAME_DIGIT::POS_1:
      //DEBUG_MSG("1");
      isrState.displayValue = (isrState.displayValue & 0xFFFFFF00U) + digit;
      isrState.receivedDigits = DIGIT::POS_1;
      break;

